#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-1hXfSDFoTm61RFFg

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.agencies_lambda.data.archive_file.agencies_source: Refreshing...
module.agencies_lambda.data.archive_file.agencies_source: Refresh complete after 0s [id=0035f2a418841c5fc85e85e43105b01c64b6894d]
module.agencies_lambda.aws_s3_object.agencies_s3_bucket: Refreshing state... [id=agencies_lambda.zip]
module.iam_maxfrise_lambdas.aws_iam_role.iam_maxfrise_lambdas: Refreshing state... [id=iam_maxfrise_lambdas]
module.maxfrise_api_gateway.aws_api_gateway_rest_api.maxfrise_api: Refreshing state... [id=8hbmj9nmrj]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.maxfrise_api_gateway.aws_api_gateway_resource.agencies_resource: Refreshing state... [id=udh18b]
module.maxfrise_api_gateway.aws_api_gateway_method.agencies_resource_method: Refreshing state... [id=agm-8hbmj9nmrj-udh18b-POST]
module.agencies_lambda.aws_lambda_function.agencies_lambda: Refreshing state... [id=agencies_lambda]
module.maxfrise_api_gateway.aws_api_gateway_method_response.agencies_resource_method_response: Refreshing state... [id=agmr-8hbmj9nmrj-udh18b-POST-200]
module.maxfrise_api_gateway.aws_lambda_permission.agencies_api_lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Refreshing state... [id=agi-8hbmj9nmrj-udh18b-POST]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment: Refreshing state... [id=v1qq76]
module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment: Refreshing state... [id=bqzjmt]
module.maxfrise_api_gateway.aws_api_gateway_stage.prod: Refreshing state... [id=ags-8hbmj9nmrj-prod]
module.maxfrise_api_gateway.aws_api_gateway_stage.test: Refreshing state... [id=ags-8hbmj9nmrj-test]
module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.maxfrise_api_gateway.aws_api_gateway_integration.agencies_lambda_integration_request has changed
  ~ resource "aws_api_gateway_integration" "agencies_lambda_integration_request" {
      + cache_key_parameters    = []
        id                      = "agi-8hbmj9nmrj-udh18b-POST"
      + request_parameters      = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_prod_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_prod_deployment" {
      ~ created_date  = "2023-06-27T06:12:41Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "v1qq76" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "5ac4ab390d61b19f9521bb1f63cb3e1f9eb017dc"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_deployment.api_test_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_test_deployment" {
      ~ created_date  = "2023-06-27T06:12:43Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-west-2:914036813947:8hbmj9nmrj/" -> (known after apply)
      ~ id            = "bqzjmt" -> (known after apply)
      ~ invoke_url    = "https://8hbmj9nmrj.execute-api.us-west-2.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "5ac4ab390d61b19f9521bb1f63cb3e1f9eb017dc"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_integration_response.agencies_lambda_integration_response will be created
  + resource "aws_api_gateway_integration_response" "agencies_lambda_integration_response" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "udh18b"
      + response_templates = {
          + "application/json" = <<-EOT
                {
                  "body" : $input.json('$'),
                  "status": 200
                }
            EOT
        }
      + rest_api_id        = "8hbmj9nmrj"
      + status_code        = "200"
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "v1qq76" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.maxfrise_api_gateway.aws_api_gateway_stage.test will be updated in-place
  ~ resource "aws_api_gateway_stage" "test" {
      ~ deployment_id         = "bqzjmt" -> (known after apply)
        id                    = "ags-8hbmj9nmrj-test"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 2 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*